sam_inbox_ms/app/controllers/received_mails_controller.rb

  def index
    #puts "USUARIO: #{params[:username]}"
    @rm = ReceivedMail.all
    @rm = @rm.by_sender(params[:sender]) if params.has_key?(:sender)
    @rm = @rm.by_read(params[:read]) if params.has_key?(:read)
    @rm = @rm.by_urgent(params[:urgent]) if params.has_key?(:urgent)
    if (params.has_key?(:page) && params.has_key?(:per_page))
      @rm = @rm.paginate(page: params[:page], per_page: params[:per_page]).order('created_at DESC')
---
SELECT "received_mails".* FROM "received_mails"
SELECT  "received_mails".* FROM "received_mails" WHERE "received_mails"."sender" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["sender", "janoguerab"], ["LIMIT", 10], ["OFFSET", 0]]

  def create
    @received_mail = ReceivedMail.new(received_mail_params)

    if @received_mail.save
---
INSERT INTO "received_mails" ("Sender", "Recipient", "Cc", "Distribution_list", "Subject", "Message_body", "Attachments", "Sent_dateTime", "Created_dateTime", "Read", "Urgent", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @received_mail.update(read_param)
---
UPDATE "received_mails" SET "read" = $1, "updated_at" = $2 WHERE "received_mails"."id" = $3  [["read", "t"], ["updated_at", "2017-10-16 23:24:43.862383"], ["id", 7]]

  def destroy
    @received_mail.destroy
---
DELETE FROM "received_mails" WHERE "received_mails"."id" = $1  [["id", 7]]

    def set_received_mail
      @received_mail = ReceivedMail.find(params[:id])
---
SELECT  "received_mails".* FROM "received_mails" WHERE "received_mails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]