sam_notifications_ms/app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
  def index
    first_result = params['firstResult']
    max_result = params['maxResult']
    if (is_numeric(first_result) || first_result.nil?) && (is_numeric(max_result) || max_result.nil?)
      @notifications = Notification.all

INSERT INTO "notifications" ("username", "sender", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "test1"], ["sender", "test1"], ["created_at", "2017-09-21 07:29:50.062204"], ["updated_at", "2017-09-21 07:29:50.062204"]]
---
  def create
    @notification = Notification.new(notification_params)

    if @notification.save

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def set_notification
    #@notification = Notification.find(params[:id])
    id = params[:id]
    if is_numeric(id)
      @notification = Notification.find(id)