sam_notifications_ms/app/controllers/user_devices_controller.rb

  def index
    first_result = params['firstResult']
    max_result = params['maxResult']
    if (is_numeric(first_result) || first_result.nil?) && (is_numeric(max_result) || max_result.nil?)
      @user_devices = UserDevice.all
---
SELECT "user_devices".* FROM "user_devices"

  def create
    @user_device = UserDevice.new(user_device_params)
    if @user_device.save
---
INSERT INTO "user_devices" ("username", "device_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "laWea"], ["device_id", "awdawd"], ["created_at", "2017-09-21 06:34:05.694500"], ["updated_at", "2017-09-21 06:34:05.694500"]]

  def destroy
    @user_device.destroy
---
DELETE FROM "user_devices" WHERE "user_devices"."id" = $1  [["id", 1]]

    def set_user_device
      #@user_device = UserDevice.find(params[:id])
      id = params[:id]
      if is_numeric(id)
        @user_device = UserDevice.find(id)
---
SELECT  "user_devices".* FROM "user_devices" WHERE "user_devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]